files/app/Http/Controllers/Users/BookingReportController.php

    public function data($filter = 'week'){

        if($filter == 'week'){
            $where = [date('Y-m-d',strtotime("-7days")),date('Y-m-d')];
        }

        if($filter == 'month'){
            $where = [date('Y-m-d',strtotime("-1month")),date('Y-m-d')];
        }

        if($filter == 'year'){
            $where = [date('Y-m-d',strtotime("-1year")),date('Y-m-d')];
        }

        $event_report_data = EventBooking::with('event.contactus')->whereHas('event')->whereBetween(\DB::raw('DATE(created_at)'),$where)->get()
            ->map(function($data){
                $temp = explode(' ', ucwords($data->event->contactus->event_type_trashed->name));
                $result = '';
                foreach($temp as $t)
                    $result .= $t[0];
                $final_name = $result .'_Event_' . str_replace("-",'',date('d-m-Y',strtotime($data->from_date))) . '' . str_replace(":",'',str_replace( "pm",'',str_replace("am",'',$data->event->start_time)));
                return [
                    "id" => $data->id,
                    "name" => $data->booking_name,
                    'created_at'   => $data->created_at,
                    "event"=> $final_name,
                    "phone"=> $data->client_phone
                ];
            });
---
select * from `type_event` where `type_event`.`id` = '22' limit 1
select * from `contactuses` where `contactuses`.`event_id` in ('17', '18', '19') and `contactuses`.`deleted_at` is null