files/app/Http/Controllers/Users/DashboardController.php

select count(*) as aggregate from `companies` where `companies`.`deleted_at` is null
select count(*) as aggregate from `contracts` where `contracts`.`deleted_at` is null
select count(*) as aggregate from `products` where `products`.`deleted_at` is null
select count(*) as aggregate from `leads` where `created_at` LIKE '2018-02%' and `leads`.`deleted_at` is null
select * from `cities` where `cities`.`id` in ('6097', '6451', '15422', '42808') and `cities`.`deleted_at` is null
select * from `companies` where `latitude` is not null and `longitude` is not null and `companies`.`deleted_at` is null
select * from `cities` where `cities`.`id` in ('42808') and `cities`.`deleted_at` is null
select * from `companies` where `country_id` = '231' and `latitude` is not null and `longitude` is not null and `companies`.`deleted_at` is null
select * from `type_event` where `type_event`.`id` in ('16', '17')
select * from `contactuses` where `contactuses`.`event_id` in ('18') and `contactuses`.`deleted_at` is null
select * from `leads` where DATE(created_at) between '2018-05-26' and '2018-06-02' and `leads`.`deleted_at` is null order by DATE(created_at) desc
---
    public function index()
    {
        if (Sentinel::check()) {

            $customers = $this->companyRepository->getAll()->count();
            $contracts = $this->contractRepository->getAll()->count();
            $event_count = Event::get()->count();
            $products = $this->productRepository->getAll()->count();

            $event_leads = array();
            for($i=4;$i>=0;$i--)
            {
                $event_leads[] =
                    array('month' =>Carbon::now()->subMonth($i)->format('M'),
                        'year' =>Carbon::now()->subMonth($i)->format('Y'),
                            'event'=>Event::where('created_at','LIKE',
                                Carbon::now()->subMonth($i)->format('Y-m').'%')->count(),
                            'leads'=>$this->leadRepository->getAll()->where('created_at','LIKE',
                              Carbon::now()->subMonth($i)->format('Y-m').'%')->count());
            }
            $decorator = Decorators::get()->count();
            $entertainer = Entertainment::get()->count();
            $photo = Photographers::get()->count();
            $caterer = EventCaterers::get()->count();
            $miscellaneous = EventMiscellaneous::get()->count();
            $transport = TransportationService::get()->count();
            $saleOrders = Event::where('status','DEFINITE')->get()->count();

            $customers_world = $this->companyRepository->getAll()
                ->with('cities')
                ->whereNotNull('latitude')
                ->whereNotNull('longitude')
                ->get()
                ->map(function ($customer) {
                    return [
                        'id' => $customer->id,
                        'latitude' => $customer->latitude,
                        'longitude' => $customer->longitude,
                        'city' => isset($customer->cities) ? $customer->cities->name : '',
                    ];
                });
            $customers_usa = $this->companyRepository->getAll()
                ->where('country_id', 231)
                ->whereNotNull('latitude')
                ->whereNotNull('longitude')
                ->with('cities')
                ->get()
                ->map(function ($customer) {
                    return [
                        'id' => $customer->id,
                        'latitude' => $customer->latitude,
                        'longitude' => $customer->longitude,
                        'city' => isset($customer->cities) ? $customer->cities->name : '',
                    ];
                });

            $today_event = Event::with('booking','owner','contactus')
                ->whereHas('booking',function ($query){
                    $query->whereBetween(\DB::raw('DATE(from_date)'),[date('Y-m-d'),date('Y-m-d',strtotime("+1week"))]);
                })->get();

            $today_leads = Lead::with('eventTypeTrashed','salesPerson')->whereBetween(\DB::raw('DATE(created_at)'),[date('Y-m-d',strtotime("-1week")),date('Y-m-d')])
                ->orderBy(\DB::raw('DATE(created_at)') ,'desc')->get();

select count(*) as aggregate from `leads` where DATE(created_at) = '2018-05-02' and `leads`.`deleted_at` is null
---
            $leads_chart = array();
            for($i=31;$i>=0;$i--)
            {
                $leads_chart[] =
                    array('month' =>Carbon::now()->subDay($i)->format('M'),
                        'year' =>Carbon::now()->subDay($i)->format('d'),
                        'lead' =>$this->leadRepository->getAll()->where(\DB::raw('DATE(created_at)'), Carbon::now()->subDay($i)->format('Y-m-d'))->count());

select * from `leads` where `leads`.`deleted_at` is null
select * from `users` where `users`.`id` in ('1') and `users`.`deleted_at` is null
select * from `contactuses` where `contactuses`.`event_id` in ('4', '5', '8', '10', '16', '17', '18', '19') and `contactuses`.`deleted_at` is null
select * from `type_event` where `type_event`.`id` in ('11', '14', '15', '21', '22')
select * from `users` where `users`.`id` in ('1', '5')
---
    function getActivity(){
        $lead_history = Lead::with('user','eventTypeTrashed','locationTrashed')->get();
        $event_history = Event::with('user','booking','contactus.event_type_trashed','booking.location_trashed')->get();

select * from `companies` where `companies`.`id` in ('0', '1', '2', '3', '4') and `companies`.`deleted_at` is null
select * from `customers` where `customers`.`deleted_at` is null
---
    public function contacts(){
        $title = trans('dashboard.contact');
        $contacts = Customer::with('company')->get();