files/app/Http/Controllers/Users/EventController.php

select * from `contactuses` where `contactuses`.`event_id` in ('4', '5', '8', '10', '16', '17', '18', '19') and `contactuses`.`deleted_at` is null
select * from `leads` where `leads`.`id` in ('0', '7', '10', '17') and `leads`.`deleted_at` is null
select * from `type_event` where `type_event`.`id` in ('11', '14', '15', '21', '22')
select * from `users` where `users`.`id` in ('3', '4', '8', '19')
select * from `deposits` where `event_id` = '4' and `deposits`.`deleted_at` is null limit 1
select * from `kids` where `event_id` = '4' and `kids`.`deleted_at` is null limit 1
---
    public function index()
    {
        $title = trans('Event Overview');
        $title2 = trans('Event List');

        $event = $this->eventRepository->getAll()
            ->with('booking', 'owner_trashed', 'booking.location_trashed', 'logistics','contactus.event_type_trashed','lead')
            ->where(function($query){
                if(!Sentinel::inRole('admin')){
                    $query->where('owner_id',Sentinel::getUser()->id);
                }
            })
            ->get()
            ->groupBy('status')
            ->toArray();


        foreach ($event as $key => $value){
            foreach ($value as  $key2 => $events){
                $data = EventFinancials::where('event_id',$events['id'])->first()->toArray();
                $data = array_values(array_diff_key($data ,['created_at'=>'0','updated_at'=>'0','deleted_at'=>'0']));
                if(in_array(null,$data)){
                    $event[$key][$key2]['remaning'][] = ['Financials','financials'];
                }
                $data = EventDeposit::where('event_id',$events['id'])->first()->toArray();
                $data = array_values(array_diff_key($data ,['created_at'=>'0','updated_at'=>'0','deleted_at'=>'0']));
                if(in_array(null,$data)){
                    $event[$key][$key2]['remaning'][] = ['Deposit','deposite_payment'];
                }
                $data = EventKids::where('event_id',$events['id'])->first()->toArray();

select * from `eating_times` where `event_id` = '4' and `eating_times`.`deleted_at` is null limit 1
---
                if(in_array(null,$data)){
                    $event[$key][$key2]['remaning'][] = ['Kids','any_kids'];
                }
                $data = EventEatingTimes::where('event_id',$events['id'])->first()->toArray();

select * from `event_equipment` where `event_id` = '4' and `event_equipment`.`deleted_at` is null limit 1
---
                if(in_array(null,$data)){
                    $event[$key][$key2]['remaning'][] = ['EatingTimes','eating_times'];
                }
                $data = EventEquipment::where('event_id',$events['id'])->first()->toArray();

select * from `event_photographers` where `event_id` = '4' and `event_photographers`.`deleted_at` is null limit 1
---
                if(in_array(null,$data)){
                    $event[$key][$key2]['remaning'][] = ['Equipment','equipment_requirements'];
                }
                $data = EventPhotographer::where('event_id',$events['id'])->first()->toArray();

select * from `event_decorators` where `event_id` = '4' and `event_decorators`.`deleted_at` is null limit 1
---
                if(in_array(null,$data)){
                    $event[$key][$key2]['remaning'][] = ['Photographer','event_photography'];
                }
                $data = EventDecorators::where('event_id',$events['id'])->first()->toArray();

select * from `event_entertainment` where `event_id` = '4' and `event_entertainment`.`deleted_at` is null limit 1
---
                if(in_array(null,$data)){
                    $event[$key][$key2]['remaning'][] = ['Decorators','event_decorator'];
                }
                $data = EventEntertainment::where('event_id',$events['id'])->first()->toArray();

select * from `guest_pickups` where `event_id` = '4' and `guest_pickups`.`deleted_at` is null limit 1
---
                if(in_array(null,$data)){
                    $event[$key][$key2]['remaning'][] = ['Entertainment','entertainment'];
                }
                $data = EventGuestPickup::where('event_id',$events['id'])->first()->toArray();

select * from `menu_type` where exists (select * from `sub_menu` where `menu_type`.`id` = `sub_menu`.`menu_type` and `id` in ('76', '77')) and `menu_type`.`deleted_at` is null
select * from `menu` where `menu`.`sub_menu_id` in ('76', '77', '167', '168') and `menu`.`deleted_at` is null
---
    public function invoicePdfShow(Event $event,Request $request)
    {

        $title = trans('Invoice');
        $event = $this->generatePdfParams($event->id);
        $sub_menu_id = [];
        $menu_items_id = [];
        foreach ($event->event_menu as $event_menu){
            $sub_menu_id[] = $event_menu->sub_menu_id;
            if(count(explode(",",$event_menu->menu_items)) > 0){
                $menu_items_id[$event_menu->sub_menu_id] = $event_menu->menu_items;
            }else{
                $menu_items_id[$event_menu->sub_menu_id] = 0;
            }
        }
        $data = MenuType::with('sub_menu','sub_menu.menu')->whereHas('sub_menu',function($query) use($sub_menu_id){
            $query->whereIn('id',$sub_menu_id);
        })->get();

select `name`, `id` from `states` where `country_id` = '231' and `states`.`deleted_at` is null order by `name` asc
select `name`, `id` from `cities` where `state_id` = '3943' and `cities`.`deleted_at` is null order by `name` asc
---
    public function edit(Event $event)
    {
        $title = trans('event.edit');

        $this->generateParams();
        $states = State::where('country_id', $event->country_id)->orderBy("name", "asc")->pluck('name', 'id');
        $cities = City::where('state_id', $event->state_id)->orderBy("name", "asc")->pluck('name', 'id');

select * from `contactuses` where `contactuses`.`event_id` in ('4', '5', '8', '10', '16', '17', '18', '19') and `contactuses`.`deleted_at` is null
---
    public function data(Datatables $datatables)
    {
        /*if(!Sentinel::inRole('admin')){
            $event = $this->eventRepository->getAll()
                ->with('booking', 'contacts', 'owner_trashed', 'booking.location_trashed', 'logistics','contactus')
                ->get()
                ->map(function ($event) {
                    $temp = explode(' ', ucwords($event->contactus->event_type_trashed->name));
                    $result = '';
                    foreach($temp as $t)
                        $result .= $t[0];

                    $final_name = $result .'_Event_' . str_replace("-",'',date('d-m-Y',strtotime($event->booking->from_date))) . '' . str_replace(":",'',str_replace( "pm",'',str_replace("am",'',$event->start_time)));
                    return [
                        'id' => $event->id,
                        'event' => $event->booking->booking_name,
                        'name' => $final_name,
                        'event_planner' => ($event->owner_trashed) ? $event->owner_trashed->first_name .' '. $event->owner_trashed->last_name : '',
                        'created_at' => date('D d,M Y',strtotime($event->booking->from_date)),
                        'time' => $event->start_time,
//                        'room' => EventRooms::select('room_name')->whereIn('id',explode(",",$event->rooms))->get()->pluck('room_name'),
                        'venue' => $event->booking->location_trashed->name,
                        'contact' => $event->booking->client_phone,
                        'status' => $event->status,

select `name`, `id` from `countries` where `countries`.`deleted_at` is null order by `name` asc
select `name`, `id` from `leadsources` where `leadsources`.`deleted_at` is null order by `name` asc
select `name`, `id` from `main_menu` where `main_menu`.`deleted_at` is null order by `name` asc
select `name`, `id` from `type_event` where `type_event`.`deleted_at` is null order by `name` asc
select `name`, `id` from `event_location` where `event_location`.`deleted_at` is null order by `name` asc
select `name`, `id` from `menu_type` where `menu_type`.`deleted_at` is null order by `name` asc
select * from `event_rooms` where `hotel_id` = '1' and `event_rooms`.`deleted_at` is null order by `room_name` asc
select `name`, `id` from `deposittypes` where `deposittypes`.`deleted_at` is null order by `name` asc
---
    private function generateParams()
    {

        $countries = Country::orderBy("name", "asc")->pluck('name', 'id')
            ->prepend(trans('lead.select_country'), '');

//        $owner = EventOwner::orderBy("name", "asc")->pluck('name', 'id')
//            ->prepend(trans('event.select_owner'), '');
        $owner = $this->userRepository->getStaff()->pluck( 'full_name', 'id' )
            ->prepend( trans( 'dashboard.select_staff' ), '' );

        $leadSource = LeadSource::orderBy("name", "asc")->pluck('name', 'id')
            ->prepend(trans('event.lead_source'), '');

        $mangers = $this->managerRepository->getAll()->get()->pluck('name', 'id');

//        $menus = Menus::orderBy("name", "asc")->pluck('name', "id");
        $main_menu = MainMenu::orderBy("name","asc")->pluck('name','id');

        $staffs = $this->userRepository->getStaff()->pluck('first_name', 'id')->prepend(trans('salesteam.team_leader'), '');

        $locations = EventLocations::orderBy("name", "asc")->pluck('name', 'id')
            ->prepend(trans('event.select_location'), '');

        $event_type = EventType::orderBy("name", "asc")->pluck('name', 'id')
            ->prepend(trans('event.select_event_type'), '');

        $hotels = Hotels::get()->pluck("name",'id');

        $event_rooms = EventRooms::orderBy("room_name", "asc")->where('hotel_id',Hotels::first()->id)->get()->toArray();

        $deposit_type = EventDepositType::orderBy("name", "asc")->pluck('name', 'id')
            ->prepend(trans('event.select_deposit_type'), '');

select `name`, `id` from `event_caterers` where `event_caterers`.`deleted_at` is null order by `name` asc
select `name`, `id` from `catering_service_type` where `catering_service_type`.`deleted_at` is null order by `name` asc
select * from `equipment` where `equipment`.`deleted_at` is null order by `name` asc
select `name`, `id` from `photographers` where `photographers`.`deleted_at` is null order by `name` asc
select `name`, `id` from `decorators` where `decorators`.`deleted_at` is null order by `name` asc
select `name`, `id` from `entertainment` where `entertainment`.`deleted_at` is null order by `name` asc
select `name`, `id` from `transportation_service` where `transportation_service`.`deleted_at` is null order by `name` asc
select `type`, `id` from `parking` where `parking`.`deleted_at` is null order by `type` asc
---
        $food_category = MenuType::orderBy("name", "asc")->pluck('name', 'id')
            ->prepend(trans('event.select_menu_type'), '');

        $caterers = EventCaterers::orderBy("name", "asc")->pluck('name', 'id')
            ->prepend(trans('event.select_caterer_type'), '');

        $service_type = CateringServiceType::orderBy("name", "asc")->pluck('name', 'id')
            ->prepend(trans('event.select_service_type'), '');

        $equipment = Equipments::orderBy("name", "asc")->get()->toArray();

        $photo = Photographers::orderBy("name", "asc")->pluck('name', 'id')
            ->prepend(trans('event.select_photographer'), '');

        $decorator = Decorators::orderBy("name", "asc")->pluck('name', 'id')
            ->prepend(trans('event.select_decorator'), '');

        $entertainment = Entertainment::orderBy("name", "asc")->pluck('name', 'id')
            ->prepend(trans('event.select_entertainment'), '');

        $transport = TransportationService::orderBy("name", "asc")->pluck('name', 'id')
            ->prepend(trans('event.select_transportation'), '');

        $parking = Parking::orderBy("type", "asc")->pluck('type', 'id')
            ->prepend(trans('event.select_parking'), '');

select `name`, `id` from `documents` where `documents`.`deleted_at` is null order by `name` asc
select `name`, `id` from `miscellaneous` where `miscellaneous`.`deleted_at` is null order by `name` asc
select `name`, `id` from `companies` where `companies`.`deleted_at` is null order by `name` asc
select `salesteam`, `id` from `sales_teams` where `sales_teams`.`deleted_at` is null order by `id` asc
---
        $assignees = $this->userRepository->getStaff()->pluck( 'full_name', 'id' )
            ->prepend( trans( 'dashboard.select_staff' ), '' );

        $doc = EventDocument::orderBy("name", "asc")->pluck("name", "id")
            ->prepend(trans("event.document"), '');

        $email_templates = EmailTemplate::get()->pluck("title","id");

        $miscellaneous = EventMiscellaneous::orderBy('name','asc')->pluck("name",'id')
            ->prepend(trans("event.miscellaneous"), '');

        $companies = Company::orderBy( "name", "asc" )->pluck( 'name', 'id' )
            ->prepend( trans( 'dashboard.personal' ), 'Personal' )
            ->prepend( trans( 'dashboard.select_company' ), '' );

        $salesteams = Salesteam::orderBy( "id", "asc" )
            ->pluck( 'salesteam', 'id' )
            ->prepend( trans( 'dashboard.select_sales_team' ), '');

select `name`, `id` from `documents` where `event_id` = '4' and `documents`.`deleted_at` is null order by `name` asc
select * from `contactuses` where `contactuses`.`event_id` in ('4') and `contactuses`.`deleted_at` is null
select * from `deposits` where `deposits`.`event_id` in ('4') and `deposits`.`deleted_at` is null
select * from `deposittypes` where `deposittypes`.`id` in ('14') and `deposittypes`.`deleted_at` is null
select * from `discussion` where `discussion`.`event_id` in ('4') and `discussion`.`deleted_at` is null
---
    private function generateShowParams($id)
    {

        $this->generateParams();
        $doc = EventDocument::where('event_id',$id)->orderBy("name", "asc")->pluck("name", "id")
            ->prepend(trans("event.document"), '');
        view()->share('doc', $doc);

        $event = Event::with('booking', 'booking.location_trashed', 'contacts', 'contactus','discussion','lead',
            'owner_trashed', 'leadSources_trashed', 'contactus.event_type', 'financials', 'financials.depositType',
            'deposit', 'kids', 'event_menu_trashed', 'eating_times', 'logistics', 'event_document', 'notes', 'payment', 'tasks'
            , 'tasks.userAssignes', 'payment.paymentMethod')->where('id', $id)->first();

select * from `contactuses` where `contactuses`.`event_id` in ('10') and `contactuses`.`deleted_at` is null
select * from `deposits` where `deposits`.`event_id` in ('10') and `deposits`.`deleted_at` is null
select * from `deposittypes` where `deposittypes`.`id` in ('') and `deposittypes`.`deleted_at` is null
select * from `documents` where `documents`.`event_id` in ('10') and `documents`.`deleted_at` is null
---
    private function generatePdfParams($id)
    {

        $this->generateParams();

        $event = Event::with('booking', 'booking.location_trashed', 'contacts', 'contactus','user','lead',
            'owner_trashed', 'leadSources_trashed', 'contactus.event_type', 'financials', 'financials.depositType', 'event_decorator_trashed', 'event_equipment_trashed',
            'deposit', 'kids', 'event_menu_trashed', 'event_menu_trashed.menu_type_trashed', 'eating_times', 'logistics', 'event_document', 'notes', 'payment', 'tasks',
            'event_photographers_trashed.photographers_trashed', 'tasks.userAssignes', 'payment.paymentMethod','additional')->where('id', $id)->first();