files/app/Http/Controllers/Users/EventReportController.php

    public function getData($filter){
        if($filter == 'week'){
            $where = [date('Y-m-d',strtotime("-7days")),date('Y-m-d')];
        }

        if($filter == 'month'){
            $where = [date('Y-m-d',strtotime("-1month")),date('Y-m-d')];
        }

        if($filter == 'year'){
            $where = [date('Y-m-d',strtotime("-1year")),date('Y-m-d')];
        }

        $event_report_data = Event::with('booking','owner_trashed','contactus')
            ->whereHas('booking',function ($query) use($where){
                $query->whereBetween(\DB::raw('DATE(from_date)'),$where);
            })->get();
---
select * from `contactuses` where `contactuses`.`event_id` in ('8', '10', '18', '19') and `contactuses`.`deleted_at` is null