files/app/Http/Controllers/Users/InvoiceController.php

select * from `contactuses` where `contactuses`.`event_id` in ('4', '5', '8', '10', '16', '17', '18', '19') and `contactuses`.`deleted_at` is null
select * from `deposits` where `deposits`.`event_id` in ('4', '5', '8', '10', '16', '17', '18', '19') and `deposits`.`deleted_at` is null
select * from `sales_teams` where `sales_teams`.`id` in ('0')
select * from `type_event` where `type_event`.`id` = '14' limit 1
select * from `sales_teams` where `id` = '0' and `sales_teams`.`deleted_at` is null limit 1
---
	 public function data(Datatables $datatables)
	{
        $event = Event::with('booking','owner_trashed','financials','deposit','contactus','sales_team_id_trashed')
            ->get()
            ->map(function ($data){
                if($data->financials){
                    $c = Salesteam::where('id',$data->sales_team_id)->first();
                    $grand_total = $data->financials->grand_total;
					if (is_countable($c)) {
						$commision = (count($c) > 0) ? ($grand_total * $c->commision) / 100 : 0;
					} else {
						$commision = 0;
					}

                    $profit = $grand_total - $commision;
//                    $profit = $data->financials->grand_total - $profit;
                }else{
                    $profit = 0;
                }
                $temp = explode(' ', ucwords($data->contactus->event_type_trashed->name));
                $result = '';
                foreach($temp as $t)
                    $result .= $t[0];
                $final_name = $result .'_Event_' . str_replace("-",'',date('d-m-Y',strtotime($data->booking->from_date))) . '' . str_replace(":",'',str_replace( "pm",'',str_replace("am",'',$data->start_time)));
                return [

select * from `payments` where exists (select * from `eventdetails` where `payments`.`event_id` = `eventdetails`.`id` and `eventdetails`.`deleted_at` is null) and `status` = 'Paid' and `payments`.`deleted_at` is null
---
	private function generateParams()
	{
		$customers = $this->userRepository->getParentCustomers()
				->pluck('full_name', 'id')
				->prepend(trans('dashboard.select_customer'), '');

		$open_invoice_total = round(EventPayments::whereHas('event')->where('status','New')->get()->sum('amount'),3);

select `name`, `id` from `companies` where `companies`.`deleted_at` is null order by `name` asc
---
				function ($title) {
					return [
						'title' => $title->title,
						'value' => $title->value,
					];
				}
			)->pluck('title', 'value');

		$companies = $this->companyRepository->getAll()->orderBy("name","asc")
			             ->pluck('name', 'id')
			             ->prepend(trans('dashboard.select_company'), '');

select `salesteam`, `id` from `sales_teams` where `sales_teams`.`deleted_at` is null
select * from `products` where `products`.`deleted_at` is null order by `id` desc
---
				function ($title) {
					return [
						'title' => $title->title,
						'value' => $title->value,
					];
				}
			)->pluck('title', 'value')->prepend(trans('invoice.status'), '');

		$payment_term = array(
			'' => trans('dashboard.select_payment_term'),
			Settings::get('payment_term1') => Settings::get('payment_term1').' Days',
			Settings::get('payment_term2') => Settings::get('payment_term2').' Days',
			Settings::get('payment_term3') => Settings::get('payment_term3').' Days',
			'0' => 'Immediate Payment',
		);
		$qtemplates = $this->quotationTemplateRepository->getAll()
				->pluck('quotation_template', 'id')
				->prepend(trans('dashboard.select_template'), '');

		$salesteams =$this->salesTeamRepository->getAll()
				->pluck('salesteam', 'id')
				->prepend(trans('dashboard.select_sales_team'), '');

		$staffs = $this->userRepository->getStaff()
				->pluck('full_name', 'id')
				->prepend(trans('dashboard.select_staff'), '');

		$products = $this->productRepository->getAll()->orderBy("id", "desc")->get();