files/app/Http/Controllers/Users/LeadController.php

	public function index() {
		$title = trans( 'lead.leads' );
		if(Sentinel::inRole('admin')){
            $lead = $this->leadRepository->getAll()
                ->with( 'country', 'salesTeam','salesPerson' )
                ->get()
                ->groupBy('priority')
                ->toArray();
        }else{
            $lead = $this->leadRepository->getAll()
                ->with( 'country', 'salesTeam','salesPerson' )
                ->where('sales_person_id',Sentinel::getUser()->id)
                ->get()
                ->groupBy('priority')
                ->toArray();
---
select * from `countries` where `countries`.`id` in ('82', '231') and `countries`.`deleted_at` is null
select * from `leads` where `leads`.`deleted_at` is null
select * from `sales_teams` where `sales_teams`.`id` in ('0') and `sales_teams`.`deleted_at` is null
select * from `users` where `users`.`id` in ('2', '3', '4', '8', '19') and `users`.`deleted_at` is null

    public function data( Datatables $datatables ) {
	    if(Sentinel::inRole('admin')){
            $leads = $this->leadRepository->getAll()
                ->with( 'country', 'salesTeam','salesPerson','company' )
                ->get()
                ->map( function ( $lead ) {
                    return [
                        'id'           => $lead->id,
                        'created_at'   => $lead->created_at,
                        'company_name' => ($lead->company) ? $lead->company->name : '',
                        'client_name' => $lead->client_name,
                        'sales_person' => ($lead->salesPerson) ? $lead->salesPerson->first_name ." ". $lead->salesPerson->last_name  : '',
//				     'product_name' => $lead->product_name,
                        'email'        => $lead->email,
                        'phone'        => $lead->mobile,
                        'calls'        => $lead->calls->count(),
                        'date'         => $lead->event_date,
                        'priority'     => $lead->priority,
                    ];
                } );
---
select * from `companies` where `companies`.`id` in ('2', '3', '4', 'Personal') and `companies`.`deleted_at` is null
select * from `countries` where `countries`.`id` in ('82', '231') and `countries`.`deleted_at` is null
select * from `leads` where `leads`.`deleted_at` is null
select * from `sales_teams` where `sales_teams`.`id` in ('0') and `sales_teams`.`deleted_at` is null