files/app/Http/Controllers/Users/MeetingController.php

select * from `meetings` where `meetings`.`deleted_at` is null
select * from `users` where `users`.`id` in ('2', '3') and `users`.`deleted_at` is null
---
    public function data(Datatables $datatables)
    {
        $meetings = $this->meetingRepository->getAll()
            ->with('responsible')
            ->get()
            ->filter(function ($meeting) {
                return ($meeting->privacy=='Everyone' ||
                        ($meeting->privacy=='Only me' && $meeting->responsible_id==$this->user->id)
                        || $meeting->user_id == Sentinel::getUser()->id);
            })
            ->map(function ($meeting) {
                return [
                    'id' => $meeting->id,
                    'meeting_subject' => $meeting->meeting_subject,
                    'starting_date' => $meeting->starting_date,
                    'ending_date' => $meeting->ending_date,
                    'responsible' => isset($meeting->responsible) ? $meeting->responsible->full_name : '',
                ];
            });