files/app/Http/Controllers/Users/SalesteamController.php

select * from `sales_teams` where `sales_teams`.`deleted_at` is null
---
    public function data(Datatables $datatables)
    {

        $salesteam = $this->salesTeamRepository->getAll()
            ->with('actualInvoice')
            ->get()
            ->map(function ($salesteam) {
            return [
                'id' => $salesteam->id,
                'salesteam' => $salesteam->salesteam,
                'target' => $salesteam->invoice_target,
//                'invoice_forecast' => $salesteam->invoice_forecast,
                'actual_invoice' => round(EventFinancials::whereHas('event' , function($query) use($salesteam){
                    $query->where('sales_team_id',$salesteam->id);
                })->get()->sum('grand_total')),
                'commision' => $salesteam->commision,
                'count_uses' => $salesteam->agentSalesteam->count() +
                    $salesteam->opportunitySalesteam->count() +
                    $salesteam->quotationSalesteam->count() +
                    $salesteam->salesorderSalesteam->count() +
                    $salesteam->actualInvoice->count()

            ];
        });