files/app/Http/Controllers/Users/SupplierReportController.php

    public function data($filter = '__'){

        if($filter == '__'){
            $entertain_data = Entertainment::get()->map(function($data){
                return [
                    "id" => $data->id,
                    "name" => $data->name,
                    "email"=>$data->email,
                    "phone"=> $data->phone,
                    "address"=> $data->address
                ];
            });
            $decorator_data = Decorators::get()->map(function($data){
                return [
                    "id" => $data->id,
                    "name" => $data->name,
                    "email"=>$data->email,
                    "phone"=> $data->phone,
                    "address"=> $data->address
                ];
            });
            $photo_data = Photographers::get()->map(function($data){
                return [
                    "id" => $data->id,
                    "name" => $data->name,
                    "email"=>$data->email,
                    "phone"=> $data->phone,
                    "address"=> $data->address
                ];
            });
            $transport_data = TransportationService::get()->map(function($data){
                return [
                    "id" => $data->id,
                    "name" => $data->name,
                    "email"=>$data->email,
                    "phone"=> $data->phone,
                    "address"=> $data->address
                ];
            });
            $caterer_data = EventCaterers::get()->map(function($data){
                return [
                    "id" => $data->id,
                    "name" => $data->name,
                    "email"=>$data->email,
                    "phone"=> $data->phone,
                    "address"=> $data->address
                ];
            });
---
select * from `entertainment` where `entertainment`.`deleted_at` is null
select * from `decorators` where `decorators`.`deleted_at` is null
select * from `photographers` where `photographers`.`deleted_at` is null
select * from `transportation_service` where `transportation_service`.`deleted_at` is null
select * from `event_caterers` where `event_caterers`.`deleted_at` is null